; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v6 ?v13)
             (pred_7 ?v4 ?v5)
             (pred_2 ?v6 ?v5)
             (pred_8 ?v10 ?v6 )
	     (pred_12 ?v6)
             (pred_3 ?v1)
             (pred_11 ?v4)
             (pred_4 ?v5)
             (pred_1 ?v6)
             (pred_5 ?v4)
             (pred_9 ?v6)
             (pred_10 ))



(:action op_1
:parameters (?v12 ?v8 ?v3 ?v2)
:precondition (and (pred_3 ?v12) (pred_3 ?v8) (pred_11 ?v3) (pred_4 ?v2)
          (pred_6 ?v12 ?v8) (pred_7 ?v3 ?v2)
                   (pred_2 ?v8 ?v2) (pred_12 ?v12) 
                   (pred_1 ?v8) (pred_5 ?v3))
:effect (and  (pred_9 ?v8) (not (pred_1 ?v8))))


(:action op_3
:parameters (?v12 ?v11)
:precondition (and (pred_3 ?v12) (pred_3 ?v11)
               (pred_12 ?v12) (pred_6 ?v12 ?v11) (pred_9 ?v11))
:effect (and (pred_12 ?v11) (not (pred_12 ?v12))))

(:action op_4
:parameters (?v12 ?v3)
:precondition (and (pred_3 ?v12) (pred_11 ?v3) 
                  (pred_12 ?v12) (pred_8 ?v3 ?v12) (pred_10 ))
:effect (and (pred_5 ?v3)
   (not (pred_8 ?v3 ?v12)) (not (pred_10 ))))


(:action op_5
:parameters (?v12 ?v7 ?v9)
:precondition (and (pred_3 ?v12) (pred_11 ?v7) (pred_11 ?v9)
                  (pred_12 ?v12) (pred_5 ?v9) (pred_8 ?v7 ?v12))
:effect (and (pred_5 ?v7) (pred_8 ?v9 ?v12)
        (not (pred_5 ?v9)) (not (pred_8 ?v7 ?v12))))

(:action op_2
:parameters (?v12 ?v3)
:precondition (and (pred_3 ?v12) (pred_11 ?v3) 
                  (pred_12 ?v12) (pred_5 ?v3))
:effect (and (pred_10 ) (pred_8 ?v3 ?v12) (not (pred_5 ?v3)))))

; problem
(define (problem grid-2-2-1-1-1)
    (:domain grid)
    (:objects
    obj_05 obj_06 obj_04 obj_01
    obj_03
    obj_02
    )

    (:init
       (pred_10)

       (pred_3 obj_05)
       (pred_3 obj_06)
       (pred_3 obj_04)
       (pred_3 obj_01)
       (pred_4 obj_03)
       (pred_11 obj_02)

       (pred_6 obj_05 obj_04)
       (pred_6 obj_05 obj_06)
       (pred_6 obj_06 obj_01)
       (pred_6 obj_06 obj_05)
       (pred_6 obj_04 obj_01)
       (pred_6 obj_04 obj_05)
       (pred_6 obj_01 obj_06)
       (pred_6 obj_01 obj_04)
       (pred_1 obj_01)
       (pred_2  obj_01 obj_03)
       (pred_9 obj_05)
       (pred_9 obj_06)
       (pred_9 obj_04)

       (pred_7  obj_02 obj_03)
       (pred_8 obj_02 obj_05)
       (pred_12 obj_05)
    )

    (:goal (and
       (pred_8 obj_02 obj_01)
    ))
(:constraints
  (always (not (pred_12 obj_06)))
)
)

; plan
1. (op_4 obj_05 obj_02)
   deleted: (pred_8 obj_02 obj_05) (pred_10)
   added: (pred_5 obj_02)
   goals met: 0 of 1
2. (op_3 obj_05 obj_04)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_04)
   goals met: 0 of 1
3. (op_1 obj_04 obj_01 obj_02 obj_03)
   deleted: (pred_1 obj_01)
   added: (pred_9 obj_01)
   goals met: 0 of 1
4. (op_3 obj_04 obj_01)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_01)
   goals met: 0 of 1
5. (op_2 obj_01 obj_02)
   deleted: (pred_5 obj_02)
   added: (pred_10) (pred_8 obj_02 obj_01)
   goals met: 1 of 1
